### dev-ci-roles Part # 1
  #### Terragrunt Format and Style 🖌`success`
  #### Terragrunt Initialization ⚙️`success`
  #### Terragrunt Validation 🤖`success`

  <details><summary>Validation Output</summary>

  ```
  Success! The configuration is valid.


  ```

  </details>

  #### Terragrunt Plan 📖`success`
  <details><summary>Show Plan</summary>

  ```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.ci_role["github-ci-admin"] will be created
  + resource "aws_iam_role" "ci_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:kolvin/kloud:pull_request",
                                  + "repo:kolvin/kloud:ref:refs/heads/*",
                                  + "repo:kolvin/kloud:ref:refs/tags/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::943824751361:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = "TrustPolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-ci-admin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ci_managed_policy["github-ci-admin_AdministratorAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "ci_managed_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "github-ci-admin"
    }

  # aws_iam_role_policy_attachment.ci_managed_policy["github-ci-admin_AmazonS3FullAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "ci_managed_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "github-ci-admin"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + role_arns            = [
      + (known after apply),
    ]
  + role_inline_polices  = {}
  + role_managed_polices = {
      + github-ci-admin = [
          + "arn:aws:iam::aws:policy/AdministratorAccess",
          + "arn:aws:iam::aws:policy/AmazonS3FullAccess",
        ]
    }
  + role_names           = [
      + "github-ci-admin",
    ]

  ```

  </details>

  *Pusher: @kolvin, Action: `pull_request`, Working Directory: `environments/dev/global/`, Workflow: `dev-ci-roles`*